"""""""""""""""""""""""
숫자 연산자
"""""""""""""""""""""""

# 사칙연산자
print(5 + 7)
print(5 - 7)
print(5 * 7)
print(5 / 7)

# 숫자 몫(정수 나누기) : //
print("3 / 2:", 3 / 2)
print("3 // 2:", 3 // 2)

# 숫자 나머지 연산자 : %
print(5 % 2)

# 제곱 연산자
print("2 ** 1 =", 2 ** 1)
print("2 ** 2 =", 2 ** 2)
print("2 ** 3 =", 2 ** 3)
print("2 ** 4 =", 2 ** 4)

# 연산자 우선순위
print("2 + 2 - 2 * 2 / 2 * 2 = ", 2 + 2 - 2 * 2 / 2 * 2)
print("2 - 2 + 2 / 2 * 2 + 2 = ", 2 - 2 + 2 / 2 * 2 + 2)

# 문자열 연산자 우선순위
print("안녕" + "하세요" * 3) # 문자열 연결 + 문자열 반복


# 문자열 + 숫자 : TypeError 예외
#print("Hello" +7)
#print("Hello" *7)


